# pandasでデータの読み込み・書き込み
pandasでのデータの取扱から、データの読み込み、書き込みを行います。

## 内容

- シリーズとは
- データフレームとは
- 概要を見る
- インデックス名、カラム名
- データのピックアップ
- データの読み込み (CSV / Excel / HTML / SQL)
- データの書き込み (CSV / Excel)
- データの再利用 (pickle)

In [1]:
import pandas as pd

pandasライブラリのインポート。
as pdとし、pdで呼び出せるようにしています。

In [2]:
import numpy as np

後で、NumPyライブラリを使って、データク作成などを行うのでインポートしておく。

## シリーズとは

In [3]:
ser = pd.Series([10, 20, 30, 40])

In [4]:
ser

0    10
1    20
2    30
3    40
dtype: int64

4要素のシリーズオブジェクトを作って、内容を表示。

シリーズオブジェクトは、1次元のデータ

## データフレームとは

In [5]:
df = pd.DataFrame([[10, "a", True], [20, "b", False,], [30, "c", False], [40, "d", True]])

In [6]:
df

    0  1      2
0  10  a   True
1  20  b  False
2  30  c  False
3  40  d   True

4行3列のデータフレームを作って、内容を表示。

データフレームは、2次元データ

## 概要を見る

In [7]:
df = pd.DataFrame(np.arange(100).reshape(25, 4))

NumPyのarangeを使って25行4列のデータを生成し、データフレームを作った

In [8]:
df

     0   1   2   3
0    0   1   2   3
1    4   5   6   7
2    8   9  10  11
3   12  13  14  15
4   16  17  18  19
5   20  21  22  23
6   24  25  26  27
7   28  29  30  31
8   32  33  34  35
9   36  37  38  39
10  40  41  42  43
11  44  45  46  47
12  48  49  50  51
13  52  53  54  55
14  56  57  58  59
15  60  61  62  63
16  64  65  66  67
17  68  69  70  71
18  72  73  74  75
19  76  77  78  79
20  80  81  82  83
21  84  85  86  87
22  88  89  90  91
23  92  93  94  95
24  96  97  98  99

In [9]:
df.head()

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [10]:
df.tail()

     0   1   2   3
20  80  81  82  83
21  84  85  86  87
22  88  89  90  91
23  92  93  94  95
24  96  97  98  99

In [11]:
df.shape

(25, 4)

## インデックス名、カラム名

pandasでは、わかりやすいインデックス名(行に名前付け)やカラム名(列に名前付け)ができます。

In [12]:
df = pd.DataFrame(np.arange(6).reshape([3, 2]))

In [13]:
df

   0  1
0  0  1
1  2  3
2  4  5

In [14]:
df.columns = ["A", "B"]

In [15]:
df.index = ["01", "02", "03"]

In [16]:
df

    A  B
01  0  1
02  2  3
03  4  5

In [17]:
named_df = pd.DataFrame(np.arange(6).reshape([3, 2]), columns=["A列", "B列"], index=["1行目", "2行目", "3行目"])

In [18]:
named_df

     A列  B列
1行目   0   1
2行目   2   3
3行目   4   5

## データのピックアップ

In [19]:
df["A"]

01    0
02    2
03    4
Name: A, dtype: int64

In [20]:
df[["A", "B"]]

    A  B
01  0  1
02  2  3
03  4  5

In [21]:
df[:2]

    A  B
01  0  1
02  2  3

In [22]:
df.loc[:, :]

    A  B
01  0  1
02  2  3
03  4  5

In [23]:
df.loc[:, "A"]

01    0
02    2
03    4
Name: A, dtype: int64

In [24]:
df.loc[:, ["A", "B"]]

    A  B
01  0  1
02  2  3
03  4  5

In [25]:
df.loc["01", :]

A    0
B    1
Name: 01, dtype: int64

In [26]:
df.loc[["01", "03"], :]

    A  B
01  0  1
03  4  5

In [27]:
df.iloc[1, 1]

3

In [28]:
df.iloc[1:, 1]

02    3
03    5
Name: B, dtype: int64

In [29]:
df.iloc[1:, :2]

    A  B
02  2  3
03  4  5

## データの読み込み (CSV / Excel / HTML / SQL)

In [30]:
df = pd.read_csv("data/201704health.csv", encoding="utf-8")

In [31]:
df

            日付     歩数  摂取カロリー
0   2017-04-01   5439    2500
1   2017-04-02   2510    2300
2   2017-04-03  10238    1950
3   2017-04-04   8209    1850
4   2017-04-05   9434    1930
5   2017-04-06   7593    1800
6   2017-04-07   9320    1940
7   2017-04-08   4873    2300
8   2017-04-09  12045    1950
9   2017-04-10   7493    1850
10  2017-04-11   7289    1930
11  2017-04-12   6481    2300
12  2017-04-13  10287    1800
13  2017-04-14   8043    1940
14  2017-04-15   7435    2300
15  2017-04-16   7529    2300
16  2017-04-17   8031    1940
17  2017-04-18   8475    2300
18  2017-04-19   8132    1950
19  2017-04-20  15328    1800
20  2017-04-21  12849    1940
21  2017-04-22   4029    2300
22  2017-04-23   3890    1950
23  2017-04-24   8093    1850
24  2017-04-25   7823    1950
25  2017-04-26   7492    1850
26  2017-04-27   7203    1930
27  2017-04-28   7302    1850
28  2017-04-29   6033    2300
29  2017-04-30   4093    1950

### Excleデータの読み込み

xlrd ライブラリが必要

```
pip install xlrd
```

In [32]:
df = pd.read_excel("data/201704health.xlsx")

In [33]:
df

            日付     歩数  摂取カロリー
0   2017-04-01   5439    2500
1   2017-04-02   2510    2300
2   2017-04-03  10238    1950
3   2017-04-04   8209    1850
4   2017-04-05   9434    1930
5   2017-04-06   7593    1800
6   2017-04-07   9320    1940
7   2017-04-08   4873    2300
8   2017-04-09  12045    1950
9   2017-04-10   7493    1850
10  2017-04-11   7289    1930
11  2017-04-12   6481    2300
12  2017-04-13  10287    1800
13  2017-04-14   8043    1940
14  2017-04-15   7435    2300
15  2017-04-16   7529    2300
16  2017-04-17   8031    1940
17  2017-04-18   8475    2300
18  2017-04-19   8132    1950
19  2017-04-20  15328    1800
20  2017-04-21  12849    1940
21  2017-04-22   4029    2300
22  2017-04-23   3890    1950
23  2017-04-24   8093    1850
24  2017-04-25   7823    1950
25  2017-04-26   7492    1850
26  2017-04-27   7203    1930
27  2017-04-28   7302    1850
28  2017-04-29   6033    2300
29  2017-04-30   4093    1950

### HTML読み込み
PyCampの開催場所データを読み込む
https://www.pycon.jp/support/bootcamp.html

lxml と BeautifulSoup4ライブラリのインストールが必要

```
pip install lxml
pip install BeautifulSoup4
```

In [34]:
# tables = pd.read_html("https://www.pycon.jp/support/bootcamp.html")
# TODO: 別のサイトを探そう SSLエラーになる。

### SQL DBからの読み込み
SQLAlchemy が必要。データベースドライバも必要。

```
pip install sqlalchemy
```

In [35]:
from sqlalchemy import create_engine

In [36]:
engine = create_engine('sqlite:///data/sample.sqlite')

In [37]:
df = pd.read_sql_table("names", engine)

In [38]:
df

   id name  age                emal
0   1   寺田   47  terada@example.com
1   2   佐藤   40    sato@example.com
2   3   鈴木   29  suzuki@example.com

## データの書き込み (CSV / Excel)

In [39]:
df

   id name  age                emal
0   1   寺田   47  terada@example.com
1   2   佐藤   40    sato@example.com
2   3   鈴木   29  suzuki@example.com

In [40]:
df.to_csv("data/write_data.csv")

### Excel書き込み

openpyxl ライブラリが必要

```
pip install openpyxl
```

In [41]:
df.to_excel("data/write_data.xlsx")

## データの再利用 (pickle)

データフレームを再利用できるように、Pythonのシリアライズ化の仕組みを使って、ファイルシステムに保存します。

In [42]:
df = pd.DataFrame(np.random.rand(25, 4))

In [43]:
df

           0         1         2         3
0   0.070103  0.827411  0.198586  0.911140
1   0.407343  0.027904  0.117152  0.429932
2   0.270779  0.833865  0.389846  0.942003
3   0.174392  0.440584  0.117443  0.764292
4   0.472698  0.115547  0.779273  0.356868
5   0.001325  0.246514  0.162025  0.518952
6   0.195728  0.394730  0.371080  0.171592
7   0.953225  0.853459  0.289417  0.151732
8   0.627079  0.834152  0.510489  0.008477
9   0.216993  0.932398  0.930984  0.574764
10  0.268625  0.647828  0.804253  0.552290
11  0.603722  0.155605  0.865249  0.723718
12  0.895080  0.475866  0.510356  0.714826
13  0.797380  0.318680  0.201922  0.883996
14  0.999813  0.886709  0.596264  0.423563
15  0.312852  0.879173  0.136487  0.338294
16  0.683009  0.371211  0.038386  0.247948
17  0.740331  0.237018  0.446928  0.822797
18  0.340720  0.817296  0.101355  0.154066
19  0.247133  0.037875  0.140846  0.700719
20  0.948390  0.200050  0.842338  0.171704
21  0.293824  0.730210  0.660063  0.533205
22  0.213308  0.994544  0.901937  0.214492
23  0.006644  0.345530  0.856322  0.498377
24  0.986546  0.105477  0.501261  0.304928

In [44]:
df.to_pickle("data/write_df.pickle")

In [45]:
df = pd.DataFrame([[1, 2, 3, 4], [4, 5, 7, 8]])

In [46]:
df

   0  1  2  3
0  1  2  3  4
1  4  5  7  8

In [47]:
df = pd.read_pickle("data/write_df.pickle")

In [48]:
df.head()

          0         1         2         3
0  0.070103  0.827411  0.198586  0.911140
1  0.407343  0.027904  0.117152  0.429932
2  0.270779  0.833865  0.389846  0.942003
3  0.174392  0.440584  0.117443  0.764292
4  0.472698  0.115547  0.779273  0.356868

In [49]:
df.shape

(25, 4)